garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f15q20.inc
// Generated 24/03/2025 GMT

/*
 * Copyright © 2025, Microchip Technology Inc. and its subsidiaries ("Microchip")
 * All rights reserved.
 * 
 * This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
 * 
 * Redistribution and use in source and binary forms, with or without modification, are
 * permitted provided that the following conditions are met:
 * 
 *     1. Redistributions of source code must retain the above copyright notice, this list of
 *        conditions and the following disclaimer.
 * 
 *     2. Redistributions in binary form must reproduce the above copyright notice, this list
 *        of conditions and the following disclaimer in the documentation and/or other
 *        materials provided with the distribution. Publication is not required when
 *        this file is used in an embedded application.
 * 
 *     3. Microchip's name may not be used to endorse or promote products derived from this
 *        software without specific prior written permission.
 * 
 * THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
 * INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
 * PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
 * INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
 * PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
 * THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#ifndef _PIC18F15Q20_INC_
#define _PIC18F15Q20_INC_

/*
 * Assembly Header file for the Microchip PIC Microcontroller
 * PIC18F15Q20
 */

/*
 * Device Registers
 */

// Register: PRLOCK
#define PRLOCK PRLOCK
PRLOCK                                   equ 0038h
// bitfield definitions
PRLOCK_PRLOCKED_POSN                     equ 0000h
PRLOCK_PRLOCKED_POSITION                 equ 0000h
PRLOCK_PRLOCKED_SIZE                     equ 0001h
PRLOCK_PRLOCKED_LENGTH                   equ 0001h
PRLOCK_PRLOCKED_MASK                     equ 0001h

// Register: MAINPR
#define MAINPR MAINPR
MAINPR                                   equ 0039h
// bitfield definitions
MAINPR_PR_POSN                           equ 0000h
MAINPR_PR_POSITION                       equ 0000h
MAINPR_PR_SIZE                           equ 0003h
MAINPR_PR_LENGTH                         equ 0003h
MAINPR_PR_MASK                           equ 0007h
MAINPR_PR0_POSN                          equ 0000h
MAINPR_PR0_POSITION                      equ 0000h
MAINPR_PR0_SIZE                          equ 0001h
MAINPR_PR0_LENGTH                        equ 0001h
MAINPR_PR0_MASK                          equ 0001h
MAINPR_PR1_POSN                          equ 0001h
MAINPR_PR1_POSITION                      equ 0001h
MAINPR_PR1_SIZE                          equ 0001h
MAINPR_PR1_LENGTH                        equ 0001h
MAINPR_PR1_MASK                          equ 0002h
MAINPR_PR2_POSN                          equ 0002h
MAINPR_PR2_POSITION                      equ 0002h
MAINPR_PR2_SIZE                          equ 0001h
MAINPR_PR2_LENGTH                        equ 0001h
MAINPR_PR2_MASK                          equ 0004h
MAINPR_MAINPR_POSN                       equ 0000h
MAINPR_MAINPR_POSITION                   equ 0000h
MAINPR_MAINPR_SIZE                       equ 0003h
MAINPR_MAINPR_LENGTH                     equ 0003h
MAINPR_MAINPR_MASK                       equ 0007h
MAINPR_MAINPR0_POSN                      equ 0000h
MAINPR_MAINPR0_POSITION                  equ 0000h
MAINPR_MAINPR0_SIZE                      equ 0001h
MAINPR_MAINPR0_LENGTH                    equ 0001h
MAINPR_MAINPR0_MASK                      equ 0001h
MAINPR_MAINPR1_POSN                      equ 0001h
MAINPR_MAINPR1_POSITION                  equ 0001h
MAINPR_MAINPR1_SIZE                      equ 0001h
MAINPR_MAINPR1_LENGTH                    equ 0001h
MAINPR_MAINPR1_MASK                      equ 0002h
MAINPR_MAINPR2_POSN                      equ 0002h
MAINPR_MAINPR2_POSITION                  equ 0002h
MAINPR_MAINPR2_SIZE                      equ 0001h
MAINPR_MAINPR2_LENGTH                    equ 0001h
MAINPR_MAINPR2_MASK                      equ 0004h

// Register: ISRPR
#define ISRPR ISRPR
ISRPR                                    equ 003Ah
// bitfield definitions
ISRPR_PR_POSN                            equ 0000h
ISRPR_PR_POSITION                        equ 0000h
ISRPR_PR_SIZE                            equ 0003h
ISRPR_PR_LENGTH                          equ 0003h
ISRPR_PR_MASK                            equ 0007h
ISRPR_PR0_POSN                           equ 0000h
ISRPR_PR0_POSITION                       equ 0000h
ISRPR_PR0_SIZE                           equ 0001h
ISRPR_PR0_LENGTH                         equ 0001h
ISRPR_PR0_MASK                           equ 0001h
ISRPR_PR1_POSN                           equ 0001h
ISRPR_PR1_POSITION                       equ 0001h
ISRPR_PR1_SIZE                           equ 0001h
ISRPR_PR1_LENGTH                         equ 0001h
ISRPR_PR1_MASK                           equ 0002h
ISRPR_PR2_POSN                           equ 0002h
ISRPR_PR2_POSITION                       equ 0002h
ISRPR_PR2_SIZE                           equ 0001h
ISRPR_PR2_LENGTH                         equ 0001h
ISRPR_PR2_MASK                           equ 0004h
ISRPR_ISRPR_POSN                         equ 0000h
ISRPR_ISRPR_POSITION                     equ 0000h
ISRPR_ISRPR_SIZE                         equ 0003h
ISRPR_ISRPR_LENGTH                       equ 0003h
ISRPR_ISRPR_MASK                         equ 0007h
ISRPR_ISRPR0_POSN                        equ 0000h
ISRPR_ISRPR0_POSITION                    equ 0000h
ISRPR_ISRPR0_SIZE                        equ 0001h
ISRPR_ISRPR0_LENGTH                      equ 0001h
ISRPR_ISRPR0_MASK                        equ 0001h
ISRPR_ISRPR1_POSN                        equ 0001h
ISRPR_ISRPR1_POSITION                    equ 0001h
ISRPR_ISRPR1_SIZE                        equ 0001h
ISRPR_ISRPR1_LENGTH                      equ 0001h
ISRPR_ISRPR1_MASK                        equ 0002h
ISRPR_ISRPR2_POSN                        equ 0002h
ISRPR_ISRPR2_POSITION                    equ 0002h
ISRPR_ISRPR2_SIZE                        equ 0001h
ISRPR_ISRPR2_LENGTH                      equ 0001h
ISRPR_ISRPR2_MASK                        equ 0004h

// Register: DMA1PR
#define DMA1PR DMA1PR
DMA1PR                                   equ 003Bh
// bitfield definitions
DMA1PR_PR_POSN                           equ 0000h
DMA1PR_PR_POSITION                       equ 0000h
DMA1PR_PR_SIZE                           equ 0003h
DMA1PR_PR_LENGTH                         equ 0003h
DMA1PR_PR_MASK                           equ 0007h
DMA1PR_PR0_POSN                          equ 0000h
DMA1PR_PR0_POSITION                      equ 0000h
DMA1PR_PR0_SIZE                          equ 0001h
DMA1PR_PR0_LENGTH                        equ 0001h
DMA1PR_PR0_MASK                          equ 0001h
DMA1PR_PR1_POSN                          equ 0001h
DMA1PR_PR1_POSITION                      equ 0001h
DMA1PR_PR1_SIZE                          equ 0001h
DMA1PR_PR1_LENGTH                        equ 0001h
DMA1PR_PR1_MASK                          equ 0002h
DMA1PR_PR2_POSN                          equ 0002h
DMA1PR_PR2_POSITION                      equ 0002h
DMA1PR_PR2_SIZE                          equ 0001h
DMA1PR_PR2_LENGTH                        equ 0001h
DMA1PR_PR2_MASK                          equ 0004h
DMA1PR_DMA1PR_POSN                       equ 0000h
DMA1PR_DMA1PR_POSITION                   equ 0000h
DMA1PR_DMA1PR_SIZE                       equ 0003h
DMA1PR_DMA1PR_LENGTH                     equ 0003h
DMA1PR_DMA1PR_MASK                       equ 0007h
DMA1PR_DMA1PR0_POSN                      equ 0000h
DMA1PR_DMA1PR0_POSITION                  equ 0000h
DMA1PR_DMA1PR0_SIZE                      equ 0001h
DMA1PR_DMA1PR0_LENGTH                    equ 0001h
DMA1PR_DMA1PR0_MASK                      equ 0001h
DMA1PR_DMA1PR1_POSN                      equ 0001h
DMA1PR_DMA1PR1_POSITION                  equ 0001h
DMA1PR_DMA1PR1_SIZE                      equ 0001h
DMA1PR_DMA1PR1_LENGTH                    equ 0001h
DMA1PR_DMA1PR1_MASK                      equ 0002h
DMA1PR_DMA1PR2_POSN                      equ 0002h
DMA1PR_DMA1PR2_POSITION                  equ 0002h
DMA1PR_DMA1PR2_SIZE                      equ 0001h
DMA1PR_DMA1PR2_LENGTH                    equ 0001h
DMA1PR_DMA1PR2_MASK                      equ 0004h

