garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f15q20.inc
// Register: I3C1BIDLH
#define I3C1BIDLH I3C1BIDLH
I3C1BIDLH                                equ 0093h
// bitfield definitions
I3C1BIDLH_BIDLH_POSN                     equ 0000h
I3C1BIDLH_BIDLH_POSITION                 equ 0000h
I3C1BIDLH_BIDLH_SIZE                     equ 0008h
I3C1BIDLH_BIDLH_LENGTH                   equ 0008h
I3C1BIDLH_BIDLH_MASK                     equ 00FFh

// Register: I3C1BAVL
#define I3C1BAVL I3C1BAVL
I3C1BAVL                                 equ 0094h
// bitfield definitions
I3C1BAVL_BAVL_POSN                       equ 0000h
I3C1BAVL_BAVL_POSITION                   equ 0000h
I3C1BAVL_BAVL_SIZE                       equ 0008h
I3C1BAVL_BAVL_LENGTH                     equ 0008h
I3C1BAVL_BAVL_MASK                       equ 00FFh

// Register: I3C1BTO
#define I3C1BTO I3C1BTO
I3C1BTO                                  equ 0095h

// Register: I3C1BTOL
#define I3C1BTOL I3C1BTOL
I3C1BTOL                                 equ 0095h
// bitfield definitions
I3C1BTOL_BTOL_POSN                       equ 0000h
I3C1BTOL_BTOL_POSITION                   equ 0000h
I3C1BTOL_BTOL_SIZE                       equ 0008h
I3C1BTOL_BTOL_LENGTH                     equ 0008h
I3C1BTOL_BTOL_MASK                       equ 00FFh

// Register: I3C1BTOH
#define I3C1BTOH I3C1BTOH
I3C1BTOH                                 equ 0096h
// bitfield definitions
I3C1BTOH_BTOH_POSN                       equ 0000h
I3C1BTOH_BTOH_POSITION                   equ 0000h
I3C1BTOH_BTOH_SIZE                       equ 0008h
I3C1BTOH_BTOH_LENGTH                     equ 0008h
I3C1BTOH_BTOH_MASK                       equ 00FFh

// Register: I3C1IBIMDB
#define I3C1IBIMDB I3C1IBIMDB
I3C1IBIMDB                               equ 0097h
// bitfield definitions
I3C1IBIMDB_IBIMDB_POSN                   equ 0000h
I3C1IBIMDB_IBIMDB_POSITION               equ 0000h
I3C1IBIMDB_IBIMDB_SIZE                   equ 0008h
I3C1IBIMDB_IBIMDB_LENGTH                 equ 0008h
I3C1IBIMDB_IBIMDB_MASK                   equ 00FFh
I3C1IBIMDB_IBIMDB_4_0_POSN               equ 0000h
I3C1IBIMDB_IBIMDB_4_0_POSITION           equ 0000h
I3C1IBIMDB_IBIMDB_4_0_SIZE               equ 0005h
I3C1IBIMDB_IBIMDB_4_0_LENGTH             equ 0005h
I3C1IBIMDB_IBIMDB_4_0_MASK               equ 001Fh
I3C1IBIMDB_IBIMDB_7_5_POSN               equ 0005h
I3C1IBIMDB_IBIMDB_7_5_POSITION           equ 0005h
I3C1IBIMDB_IBIMDB_7_5_SIZE               equ 0003h
I3C1IBIMDB_IBIMDB_7_5_LENGTH             equ 0003h
I3C1IBIMDB_IBIMDB_7_5_MASK               equ 00E0h

// Register: I3C1RETRY
#define I3C1RETRY I3C1RETRY
I3C1RETRY                                equ 0098h
// bitfield definitions
I3C1RETRY_RETRY_POSN                     equ 0000h
I3C1RETRY_RETRY_POSITION                 equ 0000h
I3C1RETRY_RETRY_SIZE                     equ 0008h
I3C1RETRY_RETRY_LENGTH                   equ 0008h
I3C1RETRY_RETRY_MASK                     equ 00FFh

// Register: I3C1FEAT
#define I3C1FEAT I3C1FEAT
I3C1FEAT                                 equ 0099h
// bitfield definitions
I3C1FEAT_HJCAP_POSN                      equ 0000h
I3C1FEAT_HJCAP_POSITION                  equ 0000h
I3C1FEAT_HJCAP_SIZE                      equ 0001h
I3C1FEAT_HJCAP_LENGTH                    equ 0001h
I3C1FEAT_HJCAP_MASK                      equ 0001h
I3C1FEAT_HDRCAP_POSN                     equ 0001h
I3C1FEAT_HDRCAP_POSITION                 equ 0001h
I3C1FEAT_HDRCAP_SIZE                     equ 0001h
I3C1FEAT_HDRCAP_LENGTH                   equ 0001h
I3C1FEAT_HDRCAP_MASK                     equ 0002h

// Register: I3C1SADR
#define I3C1SADR I3C1SADR
I3C1SADR                                 equ 009Ah
// bitfield definitions
I3C1SADR_SADR_POSN                       equ 0000h
I3C1SADR_SADR_POSITION                   equ 0000h
I3C1SADR_SADR_SIZE                       equ 0007h
I3C1SADR_SADR_LENGTH                     equ 0007h
I3C1SADR_SADR_MASK                       equ 007Fh

// Register: I3C1DADR
#define I3C1DADR I3C1DADR
I3C1DADR                                 equ 009Bh
// bitfield definitions
I3C1DADR_DADR_POSN                       equ 0000h
I3C1DADR_DADR_POSITION                   equ 0000h
I3C1DADR_DADR_SIZE                       equ 0007h
I3C1DADR_DADR_LENGTH                     equ 0007h
I3C1DADR_DADR_MASK                       equ 007Fh

// Register: I3C1EC
#define I3C1EC I3C1EC
I3C1EC                                   equ 009Ch
// bitfield definitions
I3C1EC_IBIEN_POSN                        equ 0000h
I3C1EC_IBIEN_POSITION                    equ 0000h
I3C1EC_IBIEN_SIZE                        equ 0001h
I3C1EC_IBIEN_LENGTH                      equ 0001h
I3C1EC_IBIEN_MASK                        equ 0001h
I3C1EC_CREN_POSN                         equ 0001h
I3C1EC_CREN_POSITION                     equ 0001h
I3C1EC_CREN_SIZE                         equ 0001h
I3C1EC_CREN_LENGTH                       equ 0001h
I3C1EC_CREN_MASK                         equ 0002h
I3C1EC_EC2_POSN                          equ 0002h
I3C1EC_EC2_POSITION                      equ 0002h
I3C1EC_EC2_SIZE                          equ 0001h
I3C1EC_EC2_LENGTH                        equ 0001h
I3C1EC_EC2_MASK                          equ 0004h
I3C1EC_HJEN_POSN                         equ 0003h
I3C1EC_HJEN_POSITION                     equ 0003h
I3C1EC_HJEN_SIZE                         equ 0001h
I3C1EC_HJEN_LENGTH                       equ 0001h
I3C1EC_HJEN_MASK                         equ 0008h
I3C1EC_EC_7_4_POSN                       equ 0004h
I3C1EC_EC_7_4_POSITION                   equ 0004h
I3C1EC_EC_7_4_SIZE                       equ 0004h
I3C1EC_EC_7_4_LENGTH                     equ 0004h
I3C1EC_EC_7_4_MASK                       equ 00F0h

// Register: I3C1MWL
#define I3C1MWL I3C1MWL
I3C1MWL                                  equ 009Dh

// Register: I3C1MWLL
#define I3C1MWLL I3C1MWLL
I3C1MWLL                                 equ 009Dh
// bitfield definitions
I3C1MWLL_MWLL_POSN                       equ 0000h
I3C1MWLL_MWLL_POSITION                   equ 0000h
I3C1MWLL_MWLL_SIZE                       equ 0008h
I3C1MWLL_MWLL_LENGTH                     equ 0008h
I3C1MWLL_MWLL_MASK                       equ 00FFh

// Register: I3C1MWLH
#define I3C1MWLH I3C1MWLH
I3C1MWLH                                 equ 009Eh
// bitfield definitions
I3C1MWLH_MWLH_POSN                       equ 0000h
I3C1MWLH_MWLH_POSITION                   equ 0000h
I3C1MWLH_MWLH_SIZE                       equ 0008h
I3C1MWLH_MWLH_LENGTH                     equ 0008h
I3C1MWLH_MWLH_MASK                       equ 00FFh

