garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f15q20.inc
// Register: I3C2MRLH
#define I3C2MRLH I3C2MRLH
I3C2MRLH                                 equ 00D3h
// bitfield definitions
I3C2MRLH_MRLH_POSN                       equ 0000h
I3C2MRLH_MRLH_POSITION                   equ 0000h
I3C2MRLH_MRLH_SIZE                       equ 0008h
I3C2MRLH_MRLH_LENGTH                     equ 0008h
I3C2MRLH_MRLH_MASK                       equ 00FFh

// Register: I3C2IBIPSZ
#define I3C2IBIPSZ I3C2IBIPSZ
I3C2IBIPSZ                               equ 00D4h
// bitfield definitions
I3C2IBIPSZ_IBIPSZ_POSN                   equ 0000h
I3C2IBIPSZ_IBIPSZ_POSITION               equ 0000h
I3C2IBIPSZ_IBIPSZ_SIZE                   equ 0008h
I3C2IBIPSZ_IBIPSZ_LENGTH                 equ 0008h
I3C2IBIPSZ_IBIPSZ_MASK                   equ 00FFh

// Register: I3C2PID0
#define I3C2PID0 I3C2PID0
I3C2PID0                                 equ 00D5h
// bitfield definitions
I3C2PID0_PID0_POSN                       equ 0000h
I3C2PID0_PID0_POSITION                   equ 0000h
I3C2PID0_PID0_SIZE                       equ 0001h
I3C2PID0_PID0_LENGTH                     equ 0001h
I3C2PID0_PID0_MASK                       equ 0001h
I3C2PID0_PID1_POSN                       equ 0001h
I3C2PID0_PID1_POSITION                   equ 0001h
I3C2PID0_PID1_SIZE                       equ 0001h
I3C2PID0_PID1_LENGTH                     equ 0001h
I3C2PID0_PID1_MASK                       equ 0002h
I3C2PID0_PID2_POSN                       equ 0002h
I3C2PID0_PID2_POSITION                   equ 0002h
I3C2PID0_PID2_SIZE                       equ 0001h
I3C2PID0_PID2_LENGTH                     equ 0001h
I3C2PID0_PID2_MASK                       equ 0004h
I3C2PID0_PID3_POSN                       equ 0003h
I3C2PID0_PID3_POSITION                   equ 0003h
I3C2PID0_PID3_SIZE                       equ 0001h
I3C2PID0_PID3_LENGTH                     equ 0001h
I3C2PID0_PID3_MASK                       equ 0008h
I3C2PID0_PID4_POSN                       equ 0004h
I3C2PID0_PID4_POSITION                   equ 0004h
I3C2PID0_PID4_SIZE                       equ 0001h
I3C2PID0_PID4_LENGTH                     equ 0001h
I3C2PID0_PID4_MASK                       equ 0010h
I3C2PID0_PID5_POSN                       equ 0005h
I3C2PID0_PID5_POSITION                   equ 0005h
I3C2PID0_PID5_SIZE                       equ 0001h
I3C2PID0_PID5_LENGTH                     equ 0001h
I3C2PID0_PID5_MASK                       equ 0020h
I3C2PID0_PID6_POSN                       equ 0006h
I3C2PID0_PID6_POSITION                   equ 0006h
I3C2PID0_PID6_SIZE                       equ 0001h
I3C2PID0_PID6_LENGTH                     equ 0001h
I3C2PID0_PID6_MASK                       equ 0040h
I3C2PID0_PID7_POSN                       equ 0007h
I3C2PID0_PID7_POSITION                   equ 0007h
I3C2PID0_PID7_SIZE                       equ 0001h
I3C2PID0_PID7_LENGTH                     equ 0001h
I3C2PID0_PID7_MASK                       equ 0080h
I3C2PID0_PID_7_0_POSN                    equ 0000h
I3C2PID0_PID_7_0_POSITION                equ 0000h
I3C2PID0_PID_7_0_SIZE                    equ 0008h
I3C2PID0_PID_7_0_LENGTH                  equ 0008h
I3C2PID0_PID_7_0_MASK                    equ 00FFh

// Register: I3C2PID1
#define I3C2PID1 I3C2PID1
I3C2PID1                                 equ 00D6h
// bitfield definitions
I3C2PID1_PID8_POSN                       equ 0000h
I3C2PID1_PID8_POSITION                   equ 0000h
I3C2PID1_PID8_SIZE                       equ 0001h
I3C2PID1_PID8_LENGTH                     equ 0001h
I3C2PID1_PID8_MASK                       equ 0001h
I3C2PID1_PID9_POSN                       equ 0001h
I3C2PID1_PID9_POSITION                   equ 0001h
I3C2PID1_PID9_SIZE                       equ 0001h
I3C2PID1_PID9_LENGTH                     equ 0001h
I3C2PID1_PID9_MASK                       equ 0002h
I3C2PID1_PID10_POSN                      equ 0002h
I3C2PID1_PID10_POSITION                  equ 0002h
I3C2PID1_PID10_SIZE                      equ 0001h
I3C2PID1_PID10_LENGTH                    equ 0001h
I3C2PID1_PID10_MASK                      equ 0004h
I3C2PID1_PID11_POSN                      equ 0003h
I3C2PID1_PID11_POSITION                  equ 0003h
I3C2PID1_PID11_SIZE                      equ 0001h
I3C2PID1_PID11_LENGTH                    equ 0001h
I3C2PID1_PID11_MASK                      equ 0008h
I3C2PID1_PID12_POSN                      equ 0004h
I3C2PID1_PID12_POSITION                  equ 0004h
I3C2PID1_PID12_SIZE                      equ 0001h
I3C2PID1_PID12_LENGTH                    equ 0001h
I3C2PID1_PID12_MASK                      equ 0010h
I3C2PID1_PID13_POSN                      equ 0005h
I3C2PID1_PID13_POSITION                  equ 0005h
I3C2PID1_PID13_SIZE                      equ 0001h
I3C2PID1_PID13_LENGTH                    equ 0001h
I3C2PID1_PID13_MASK                      equ 0020h
I3C2PID1_PID14_POSN                      equ 0006h
I3C2PID1_PID14_POSITION                  equ 0006h
I3C2PID1_PID14_SIZE                      equ 0001h
I3C2PID1_PID14_LENGTH                    equ 0001h
I3C2PID1_PID14_MASK                      equ 0040h
I3C2PID1_PID15_POSN                      equ 0007h
I3C2PID1_PID15_POSITION                  equ 0007h
I3C2PID1_PID15_SIZE                      equ 0001h
I3C2PID1_PID15_LENGTH                    equ 0001h
I3C2PID1_PID15_MASK                      equ 0080h
I3C2PID1_PID_11_8_POSN                   equ 0000h
I3C2PID1_PID_11_8_POSITION               equ 0000h
I3C2PID1_PID_11_8_SIZE                   equ 0004h
I3C2PID1_PID_11_8_LENGTH                 equ 0004h
I3C2PID1_PID_11_8_MASK                   equ 000Fh
I3C2PID1_PID_15_12_POSN                  equ 0004h
I3C2PID1_PID_15_12_POSITION              equ 0004h
I3C2PID1_PID_15_12_SIZE                  equ 0004h
I3C2PID1_PID_15_12_LENGTH                equ 0004h
I3C2PID1_PID_15_12_MASK                  equ 00F0h

// Register: I3C2PID2
#define I3C2PID2 I3C2PID2
I3C2PID2                                 equ 00D7h
// bitfield definitions
I3C2PID2_PID16_POSN                      equ 0000h
I3C2PID2_PID16_POSITION                  equ 0000h
I3C2PID2_PID16_SIZE                      equ 0001h
I3C2PID2_PID16_LENGTH                    equ 0001h
I3C2PID2_PID16_MASK                      equ 0001h
I3C2PID2_PID17_POSN                      equ 0001h
I3C2PID2_PID17_POSITION                  equ 0001h
I3C2PID2_PID17_SIZE                      equ 0001h
I3C2PID2_PID17_LENGTH                    equ 0001h
I3C2PID2_PID17_MASK                      equ 0002h
I3C2PID2_PID18_POSN                      equ 0002h
I3C2PID2_PID18_POSITION                  equ 0002h
I3C2PID2_PID18_SIZE                      equ 0001h
I3C2PID2_PID18_LENGTH                    equ 0001h
I3C2PID2_PID18_MASK                      equ 0004h
I3C2PID2_PID19_POSN                      equ 0003h
I3C2PID2_PID19_POSITION                  equ 0003h
I3C2PID2_PID19_SIZE                      equ 0001h
I3C2PID2_PID19_LENGTH                    equ 0001h
I3C2PID2_PID19_MASK                      equ 0008h
I3C2PID2_PID20_POSN                      equ 0004h
I3C2PID2_PID20_POSITION                  equ 0004h
I3C2PID2_PID20_SIZE                      equ 0001h
I3C2PID2_PID20_LENGTH                    equ 0001h
I3C2PID2_PID20_MASK                      equ 0010h
I3C2PID2_PID21_POSN                      equ 0005h
I3C2PID2_PID21_POSITION                  equ 0005h
I3C2PID2_PID21_SIZE                      equ 0001h
I3C2PID2_PID21_LENGTH                    equ 0001h
I3C2PID2_PID21_MASK                      equ 0020h
I3C2PID2_PID22_POSN                      equ 0006h
I3C2PID2_PID22_POSITION                  equ 0006h
I3C2PID2_PID22_SIZE                      equ 0001h
I3C2PID2_PID22_LENGTH                    equ 0001h
I3C2PID2_PID22_MASK                      equ 0040h
I3C2PID2_PID23_POSN                      equ 0007h
I3C2PID2_PID23_POSITION                  equ 0007h
I3C2PID2_PID23_SIZE                      equ 0001h
I3C2PID2_PID23_LENGTH                    equ 0001h
I3C2PID2_PID23_MASK                      equ 0080h
I3C2PID2_PID_23_16_POSN                  equ 0000h
I3C2PID2_PID_23_16_POSITION              equ 0000h
I3C2PID2_PID_23_16_SIZE                  equ 0008h
I3C2PID2_PID_23_16_LENGTH                equ 0008h
I3C2PID2_PID_23_16_MASK                  equ 00FFh

// Register: I3C2PID3
#define I3C2PID3 I3C2PID3
I3C2PID3                                 equ 00D8h
// bitfield definitions
I3C2PID3_PID24_POSN                      equ 0000h
I3C2PID3_PID24_POSITION                  equ 0000h
I3C2PID3_PID24_SIZE                      equ 0001h
I3C2PID3_PID24_LENGTH                    equ 0001h
I3C2PID3_PID24_MASK                      equ 0001h
I3C2PID3_PID25_POSN                      equ 0001h
I3C2PID3_PID25_POSITION                  equ 0001h
I3C2PID3_PID25_SIZE                      equ 0001h
I3C2PID3_PID25_LENGTH                    equ 0001h
I3C2PID3_PID25_MASK                      equ 0002h
I3C2PID3_PID26_POSN                      equ 0002h
I3C2PID3_PID26_POSITION                  equ 0002h
I3C2PID3_PID26_SIZE                      equ 0001h
I3C2PID3_PID26_LENGTH                    equ 0001h
I3C2PID3_PID26_MASK                      equ 0004h
I3C2PID3_PID27_POSN                      equ 0003h
I3C2PID3_PID27_POSITION                  equ 0003h
I3C2PID3_PID27_SIZE                      equ 0001h
I3C2PID3_PID27_LENGTH                    equ 0001h
I3C2PID3_PID27_MASK                      equ 0008h
I3C2PID3_PID28_POSN                      equ 0004h
I3C2PID3_PID28_POSITION                  equ 0004h
I3C2PID3_PID28_SIZE                      equ 0001h
I3C2PID3_PID28_LENGTH                    equ 0001h
I3C2PID3_PID28_MASK                      equ 0010h
I3C2PID3_PID29_POSN                      equ 0005h
I3C2PID3_PID29_POSITION                  equ 0005h
I3C2PID3_PID29_SIZE                      equ 0001h
I3C2PID3_PID29_LENGTH                    equ 0001h
I3C2PID3_PID29_MASK                      equ 0020h
I3C2PID3_PID30_POSN                      equ 0006h
I3C2PID3_PID30_POSITION                  equ 0006h
I3C2PID3_PID30_SIZE                      equ 0001h
I3C2PID3_PID30_LENGTH                    equ 0001h
I3C2PID3_PID30_MASK                      equ 0040h
I3C2PID3_PID31_POSN                      equ 0007h
I3C2PID3_PID31_POSITION                  equ 0007h
I3C2PID3_PID31_SIZE                      equ 0001h
I3C2PID3_PID31_LENGTH                    equ 0001h
I3C2PID3_PID31_MASK                      equ 0080h
I3C2PID3_PID_31_24_POSN                  equ 0000h
I3C2PID3_PID_31_24_POSITION              equ 0000h
I3C2PID3_PID_31_24_SIZE                  equ 0008h
I3C2PID3_PID_31_24_LENGTH                equ 0008h
I3C2PID3_PID_31_24_MASK                  equ 00FFh

