garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f15q20.inc
// Register: I3C2MRT
#define I3C2MRT I3C2MRT
I3C2MRT                                  equ 00E1h

// Register: I3C2MRTL
#define I3C2MRTL I3C2MRTL
I3C2MRTL                                 equ 00E1h
// bitfield definitions
I3C2MRTL_MRTL_POSN                       equ 0000h
I3C2MRTL_MRTL_POSITION                   equ 0000h
I3C2MRTL_MRTL_SIZE                       equ 0008h
I3C2MRTL_MRTL_LENGTH                     equ 0008h
I3C2MRTL_MRTL_MASK                       equ 00FFh

// Register: I3C2MRTH
#define I3C2MRTH I3C2MRTH
I3C2MRTH                                 equ 00E2h
// bitfield definitions
I3C2MRTH_MRTH_POSN                       equ 0000h
I3C2MRTH_MRTH_POSITION                   equ 0000h
I3C2MRTH_MRTH_SIZE                       equ 0008h
I3C2MRTH_MRTH_LENGTH                     equ 0008h
I3C2MRTH_MRTH_MASK                       equ 00FFh

// Register: I3C2MRTU
#define I3C2MRTU I3C2MRTU
I3C2MRTU                                 equ 00E3h
// bitfield definitions
I3C2MRTU_MRTU_POSN                       equ 0000h
I3C2MRTU_MRTU_POSITION                   equ 0000h
I3C2MRTU_MRTU_SIZE                       equ 0008h
I3C2MRTU_MRTU_LENGTH                     equ 0008h
I3C2MRTU_MRTU_MASK                       equ 00FFh

// Register: I3C2RSTACT
#define I3C2RSTACT I3C2RSTACT
I3C2RSTACT                               equ 00E4h
// bitfield definitions
I3C2RSTACT_RSTACT_POSN                   equ 0000h
I3C2RSTACT_RSTACT_POSITION               equ 0000h
I3C2RSTACT_RSTACT_SIZE                   equ 0008h
I3C2RSTACT_RSTACT_LENGTH                 equ 0008h
I3C2RSTACT_RSTACT_MASK                   equ 00FFh

// Register: I3C2BUSCXT
#define I3C2BUSCXT I3C2BUSCXT
I3C2BUSCXT                               equ 00E5h
// bitfield definitions
I3C2BUSCXT_BUSCXT_POSN                   equ 0000h
I3C2BUSCXT_BUSCXT_POSITION               equ 0000h
I3C2BUSCXT_BUSCXT_SIZE                   equ 0008h
I3C2BUSCXT_BUSCXT_LENGTH                 equ 0008h
I3C2BUSCXT_BUSCXT_MASK                   equ 00FFh

// Register: I3C2CCC
#define I3C2CCC I3C2CCC
I3C2CCC                                  equ 00E6h
// bitfield definitions
I3C2CCC_CCC_POSN                         equ 0000h
I3C2CCC_CCC_POSITION                     equ 0000h
I3C2CCC_CCC_SIZE                         equ 0008h
I3C2CCC_CCC_LENGTH                       equ 0008h
I3C2CCC_CCC_MASK                         equ 00FFh

// Register: I3C2I2CCON
#define I3C2I2CCON I3C2I2CCON
I3C2I2CCON                               equ 00E7h
// bitfield definitions
I3C2I2CCON_SDAHT_POSN                    equ 0000h
I3C2I2CCON_SDAHT_POSITION                equ 0000h
I3C2I2CCON_SDAHT_SIZE                    equ 0002h
I3C2I2CCON_SDAHT_LENGTH                  equ 0002h
I3C2I2CCON_SDAHT_MASK                    equ 0003h
I3C2I2CCON_FLTEN_POSN                    equ 0002h
I3C2I2CCON_FLTEN_POSITION                equ 0002h
I3C2I2CCON_FLTEN_SIZE                    equ 0001h
I3C2I2CCON_FLTEN_LENGTH                  equ 0001h
I3C2I2CCON_FLTEN_MASK                    equ 0004h

// Register: I3C2CLK
#define I3C2CLK I3C2CLK
I3C2CLK                                  equ 00E8h
// bitfield definitions
I3C2CLK_CLK_POSN                         equ 0000h
I3C2CLK_CLK_POSITION                     equ 0000h
I3C2CLK_CLK_SIZE                         equ 0008h
I3C2CLK_CLK_LENGTH                       equ 0008h
I3C2CLK_CLK_MASK                         equ 00FFh
I3C2CLK_CLK0_POSN                        equ 0000h
I3C2CLK_CLK0_POSITION                    equ 0000h
I3C2CLK_CLK0_SIZE                        equ 0001h
I3C2CLK_CLK0_LENGTH                      equ 0001h
I3C2CLK_CLK0_MASK                        equ 0001h
I3C2CLK_CLK1_POSN                        equ 0001h
I3C2CLK_CLK1_POSITION                    equ 0001h
I3C2CLK_CLK1_SIZE                        equ 0001h
I3C2CLK_CLK1_LENGTH                      equ 0001h
I3C2CLK_CLK1_MASK                        equ 0002h
I3C2CLK_CLK2_POSN                        equ 0002h
I3C2CLK_CLK2_POSITION                    equ 0002h
I3C2CLK_CLK2_SIZE                        equ 0001h
I3C2CLK_CLK2_LENGTH                      equ 0001h
I3C2CLK_CLK2_MASK                        equ 0004h
I3C2CLK_CLK3_POSN                        equ 0003h
I3C2CLK_CLK3_POSITION                    equ 0003h
I3C2CLK_CLK3_SIZE                        equ 0001h
I3C2CLK_CLK3_LENGTH                      equ 0001h
I3C2CLK_CLK3_MASK                        equ 0008h

// Register: CLKRCON
#define CLKRCON CLKRCON
CLKRCON                                  equ 0100h
// bitfield definitions
CLKRCON_DIV_POSN                         equ 0000h
CLKRCON_DIV_POSITION                     equ 0000h
CLKRCON_DIV_SIZE                         equ 0003h
CLKRCON_DIV_LENGTH                       equ 0003h
CLKRCON_DIV_MASK                         equ 0007h
CLKRCON_DC_POSN                          equ 0003h
CLKRCON_DC_POSITION                      equ 0003h
CLKRCON_DC_SIZE                          equ 0002h
CLKRCON_DC_LENGTH                        equ 0002h
CLKRCON_DC_MASK                          equ 0018h
CLKRCON_EN_POSN                          equ 0007h
CLKRCON_EN_POSITION                      equ 0007h
CLKRCON_EN_SIZE                          equ 0001h
CLKRCON_EN_LENGTH                        equ 0001h
CLKRCON_EN_MASK                          equ 0080h
CLKRCON_CLKRDIV0_POSN                    equ 0000h
CLKRCON_CLKRDIV0_POSITION                equ 0000h
CLKRCON_CLKRDIV0_SIZE                    equ 0001h
CLKRCON_CLKRDIV0_LENGTH                  equ 0001h
CLKRCON_CLKRDIV0_MASK                    equ 0001h
CLKRCON_CLKRDIV1_POSN                    equ 0001h
CLKRCON_CLKRDIV1_POSITION                equ 0001h
CLKRCON_CLKRDIV1_SIZE                    equ 0001h
CLKRCON_CLKRDIV1_LENGTH                  equ 0001h
CLKRCON_CLKRDIV1_MASK                    equ 0002h
CLKRCON_CLKRDIV2_POSN                    equ 0002h
CLKRCON_CLKRDIV2_POSITION                equ 0002h
CLKRCON_CLKRDIV2_SIZE                    equ 0001h
CLKRCON_CLKRDIV2_LENGTH                  equ 0001h
CLKRCON_CLKRDIV2_MASK                    equ 0004h
CLKRCON_CLKRDC0_POSN                     equ 0003h
CLKRCON_CLKRDC0_POSITION                 equ 0003h
CLKRCON_CLKRDC0_SIZE                     equ 0001h
CLKRCON_CLKRDC0_LENGTH                   equ 0001h
CLKRCON_CLKRDC0_MASK                     equ 0008h
CLKRCON_CLKRDC1_POSN                     equ 0004h
CLKRCON_CLKRDC1_POSITION                 equ 0004h
CLKRCON_CLKRDC1_SIZE                     equ 0001h
CLKRCON_CLKRDC1_LENGTH                   equ 0001h
CLKRCON_CLKRDC1_MASK                     equ 0010h
CLKRCON_CLKREN_POSN                      equ 0007h
CLKRCON_CLKREN_POSITION                  equ 0007h
CLKRCON_CLKREN_SIZE                      equ 0001h
CLKRCON_CLKREN_LENGTH                    equ 0001h
CLKRCON_CLKREN_MASK                      equ 0080h
CLKRCON_DIV0_POSN                        equ 0000h
CLKRCON_DIV0_POSITION                    equ 0000h
CLKRCON_DIV0_SIZE                        equ 0001h
CLKRCON_DIV0_LENGTH                      equ 0001h
CLKRCON_DIV0_MASK                        equ 0001h
CLKRCON_DIV1_POSN                        equ 0001h
CLKRCON_DIV1_POSITION                    equ 0001h
CLKRCON_DIV1_SIZE                        equ 0001h
CLKRCON_DIV1_LENGTH                      equ 0001h
CLKRCON_DIV1_MASK                        equ 0002h
CLKRCON_DIV2_POSN                        equ 0002h
CLKRCON_DIV2_POSITION                    equ 0002h
CLKRCON_DIV2_SIZE                        equ 0001h
CLKRCON_DIV2_LENGTH                      equ 0001h
CLKRCON_DIV2_MASK                        equ 0004h
CLKRCON_DC0_POSN                         equ 0003h
CLKRCON_DC0_POSITION                     equ 0003h
CLKRCON_DC0_SIZE                         equ 0001h
CLKRCON_DC0_LENGTH                       equ 0001h
CLKRCON_DC0_MASK                         equ 0008h
CLKRCON_DC1_POSN                         equ 0004h
CLKRCON_DC1_POSITION                     equ 0004h
CLKRCON_DC1_SIZE                         equ 0001h
CLKRCON_DC1_LENGTH                       equ 0001h
CLKRCON_DC1_MASK                         equ 0010h

