garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f15q20.inc
// Register: PMD2
#define PMD2 PMD2
PMD2                                     equ 0302h
// bitfield definitions
PMD2_TU16AMD_POSN                        equ 0000h
PMD2_TU16AMD_POSITION                    equ 0000h
PMD2_TU16AMD_SIZE                        equ 0001h
PMD2_TU16AMD_LENGTH                      equ 0001h
PMD2_TU16AMD_MASK                        equ 0001h
PMD2_TU16BMD_POSN                        equ 0001h
PMD2_TU16BMD_POSITION                    equ 0001h
PMD2_TU16BMD_SIZE                        equ 0001h
PMD2_TU16BMD_LENGTH                      equ 0001h
PMD2_TU16BMD_MASK                        equ 0002h
PMD2_CCP1MD_POSN                         equ 0002h
PMD2_CCP1MD_POSITION                     equ 0002h
PMD2_CCP1MD_SIZE                         equ 0001h
PMD2_CCP1MD_LENGTH                       equ 0001h
PMD2_CCP1MD_MASK                         equ 0004h
PMD2_CCP2MD_POSN                         equ 0003h
PMD2_CCP2MD_POSITION                     equ 0003h
PMD2_CCP2MD_SIZE                         equ 0001h
PMD2_CCP2MD_LENGTH                       equ 0001h
PMD2_CCP2MD_MASK                         equ 0008h
PMD2_PWM1MD_POSN                         equ 0004h
PMD2_PWM1MD_POSITION                     equ 0004h
PMD2_PWM1MD_SIZE                         equ 0001h
PMD2_PWM1MD_LENGTH                       equ 0001h
PMD2_PWM1MD_MASK                         equ 0010h
PMD2_PWM2MD_POSN                         equ 0005h
PMD2_PWM2MD_POSITION                     equ 0005h
PMD2_PWM2MD_SIZE                         equ 0001h
PMD2_PWM2MD_LENGTH                       equ 0001h
PMD2_PWM2MD_MASK                         equ 0020h
PMD2_CWG1MD_POSN                         equ 0006h
PMD2_CWG1MD_POSITION                     equ 0006h
PMD2_CWG1MD_SIZE                         equ 0001h
PMD2_CWG1MD_LENGTH                       equ 0001h
PMD2_CWG1MD_MASK                         equ 0040h
PMD2_CLC1MD_POSN                         equ 0007h
PMD2_CLC1MD_POSITION                     equ 0007h
PMD2_CLC1MD_SIZE                         equ 0001h
PMD2_CLC1MD_LENGTH                       equ 0001h
PMD2_CLC1MD_MASK                         equ 0080h

// Register: PMD3
#define PMD3 PMD3
PMD3                                     equ 0303h
// bitfield definitions
PMD3_CLC2MD_POSN                         equ 0000h
PMD3_CLC2MD_POSITION                     equ 0000h
PMD3_CLC2MD_SIZE                         equ 0001h
PMD3_CLC2MD_LENGTH                       equ 0001h
PMD3_CLC2MD_MASK                         equ 0001h
PMD3_CLC3MD_POSN                         equ 0001h
PMD3_CLC3MD_POSITION                     equ 0001h
PMD3_CLC3MD_SIZE                         equ 0001h
PMD3_CLC3MD_LENGTH                       equ 0001h
PMD3_CLC3MD_MASK                         equ 0002h
PMD3_CLC4MD_POSN                         equ 0002h
PMD3_CLC4MD_POSITION                     equ 0002h
PMD3_CLC4MD_SIZE                         equ 0001h
PMD3_CLC4MD_LENGTH                       equ 0001h
PMD3_CLC4MD_MASK                         equ 0004h
PMD3_U1MD_POSN                           equ 0003h
PMD3_U1MD_POSITION                       equ 0003h
PMD3_U1MD_SIZE                           equ 0001h
PMD3_U1MD_LENGTH                         equ 0001h
PMD3_U1MD_MASK                           equ 0008h
PMD3_U2MD_POSN                           equ 0004h
PMD3_U2MD_POSITION                       equ 0004h
PMD3_U2MD_SIZE                           equ 0001h
PMD3_U2MD_LENGTH                         equ 0001h
PMD3_U2MD_MASK                           equ 0010h
PMD3_SPI1MD_POSN                         equ 0005h
PMD3_SPI1MD_POSITION                     equ 0005h
PMD3_SPI1MD_SIZE                         equ 0001h
PMD3_SPI1MD_LENGTH                       equ 0001h
PMD3_SPI1MD_MASK                         equ 0020h
PMD3_I2C1MD_POSN                         equ 0006h
PMD3_I2C1MD_POSITION                     equ 0006h
PMD3_I2C1MD_SIZE                         equ 0001h
PMD3_I2C1MD_LENGTH                       equ 0001h
PMD3_I2C1MD_MASK                         equ 0040h
PMD3_I3C1MD_POSN                         equ 0007h
PMD3_I3C1MD_POSITION                     equ 0007h
PMD3_I3C1MD_SIZE                         equ 0001h
PMD3_I3C1MD_LENGTH                       equ 0001h
PMD3_I3C1MD_MASK                         equ 0080h

// Register: PMD4
#define PMD4 PMD4
PMD4                                     equ 0304h
// bitfield definitions
PMD4_I3C2MD_POSN                         equ 0000h
PMD4_I3C2MD_POSITION                     equ 0000h
PMD4_I3C2MD_SIZE                         equ 0001h
PMD4_I3C2MD_LENGTH                       equ 0001h
PMD4_I3C2MD_MASK                         equ 0001h
PMD4_FVRMD_POSN                          equ 0001h
PMD4_FVRMD_POSITION                      equ 0001h
PMD4_FVRMD_SIZE                          equ 0001h
PMD4_FVRMD_LENGTH                        equ 0001h
PMD4_FVRMD_MASK                          equ 0002h
PMD4_HLVDMD_POSN                         equ 0002h
PMD4_HLVDMD_POSITION                     equ 0002h
PMD4_HLVDMD_SIZE                         equ 0001h
PMD4_HLVDMD_LENGTH                       equ 0001h
PMD4_HLVDMD_MASK                         equ 0004h
PMD4_ADCMD_POSN                          equ 0003h
PMD4_ADCMD_POSITION                      equ 0003h
PMD4_ADCMD_SIZE                          equ 0001h
PMD4_ADCMD_LENGTH                        equ 0001h
PMD4_ADCMD_MASK                          equ 0008h

// Register: RB5FEAT
#define RB5FEAT RB5FEAT
RB5FEAT                                  equ 030Fh
// bitfield definitions
RB5FEAT_SYSBUF_POSN                      equ 0000h
RB5FEAT_SYSBUF_POSITION                  equ 0000h
RB5FEAT_SYSBUF_SIZE                      equ 0003h
RB5FEAT_SYSBUF_LENGTH                    equ 0003h
RB5FEAT_SYSBUF_MASK                      equ 0007h
RB5FEAT_I3CBUF_POSN                      equ 0003h
RB5FEAT_I3CBUF_POSITION                  equ 0003h
RB5FEAT_I3CBUF_SIZE                      equ 0003h
RB5FEAT_I3CBUF_LENGTH                    equ 0003h
RB5FEAT_I3CBUF_MASK                      equ 0038h
RB5FEAT_SLEW_POSN                        equ 0006h
RB5FEAT_SLEW_POSITION                    equ 0006h
RB5FEAT_SLEW_SIZE                        equ 0002h
RB5FEAT_SLEW_LENGTH                      equ 0002h
RB5FEAT_SLEW_MASK                        equ 00C0h

// Register: RB6FEAT
#define RB6FEAT RB6FEAT
RB6FEAT                                  equ 0310h
// bitfield definitions
RB6FEAT_SYSBUF_POSN                      equ 0000h
RB6FEAT_SYSBUF_POSITION                  equ 0000h
RB6FEAT_SYSBUF_SIZE                      equ 0003h
RB6FEAT_SYSBUF_LENGTH                    equ 0003h
RB6FEAT_SYSBUF_MASK                      equ 0007h
RB6FEAT_I3CBUF_POSN                      equ 0003h
RB6FEAT_I3CBUF_POSITION                  equ 0003h
RB6FEAT_I3CBUF_SIZE                      equ 0003h
RB6FEAT_I3CBUF_LENGTH                    equ 0003h
RB6FEAT_I3CBUF_MASK                      equ 0038h
RB6FEAT_SLEW_POSN                        equ 0006h
RB6FEAT_SLEW_POSITION                    equ 0006h
RB6FEAT_SLEW_SIZE                        equ 0002h
RB6FEAT_SLEW_LENGTH                      equ 0002h
RB6FEAT_SLEW_MASK                        equ 00C0h

// Register: RC0FEAT
#define RC0FEAT RC0FEAT
RC0FEAT                                  equ 0312h
// bitfield definitions
RC0FEAT_SYSBUF_POSN                      equ 0000h
RC0FEAT_SYSBUF_POSITION                  equ 0000h
RC0FEAT_SYSBUF_SIZE                      equ 0003h
RC0FEAT_SYSBUF_LENGTH                    equ 0003h
RC0FEAT_SYSBUF_MASK                      equ 0007h
RC0FEAT_I3CBUF_POSN                      equ 0003h
RC0FEAT_I3CBUF_POSITION                  equ 0003h
RC0FEAT_I3CBUF_SIZE                      equ 0003h
RC0FEAT_I3CBUF_LENGTH                    equ 0003h
RC0FEAT_I3CBUF_MASK                      equ 0038h
RC0FEAT_SLEW_POSN                        equ 0006h
RC0FEAT_SLEW_POSITION                    equ 0006h
RC0FEAT_SLEW_SIZE                        equ 0002h
RC0FEAT_SLEW_LENGTH                      equ 0002h
RC0FEAT_SLEW_MASK                        equ 00C0h

// Register: RC1FEAT
#define RC1FEAT RC1FEAT
RC1FEAT                                  equ 0313h
// bitfield definitions
RC1FEAT_SYSBUF_POSN                      equ 0000h
RC1FEAT_SYSBUF_POSITION                  equ 0000h
RC1FEAT_SYSBUF_SIZE                      equ 0003h
RC1FEAT_SYSBUF_LENGTH                    equ 0003h
RC1FEAT_SYSBUF_MASK                      equ 0007h
RC1FEAT_I3CBUF_POSN                      equ 0003h
RC1FEAT_I3CBUF_POSITION                  equ 0003h
RC1FEAT_I3CBUF_SIZE                      equ 0003h
RC1FEAT_I3CBUF_LENGTH                    equ 0003h
RC1FEAT_I3CBUF_MASK                      equ 0038h
RC1FEAT_SLEW_POSN                        equ 0006h
RC1FEAT_SLEW_POSITION                    equ 0006h
RC1FEAT_SLEW_SIZE                        equ 0002h
RC1FEAT_SLEW_LENGTH                      equ 0002h
RC1FEAT_SLEW_MASK                        equ 00C0h

// Register: RC4FEAT
#define RC4FEAT RC4FEAT
RC4FEAT                                  equ 0315h
// bitfield definitions
RC4FEAT_SYSBUF_POSN                      equ 0000h
RC4FEAT_SYSBUF_POSITION                  equ 0000h
RC4FEAT_SYSBUF_SIZE                      equ 0002h
RC4FEAT_SYSBUF_LENGTH                    equ 0002h
RC4FEAT_SYSBUF_MASK                      equ 0003h
RC4FEAT_SLEW_POSN                        equ 0006h
RC4FEAT_SLEW_POSITION                    equ 0006h
RC4FEAT_SLEW_SIZE                        equ 0002h
RC4FEAT_SLEW_LENGTH                      equ 0002h
RC4FEAT_SLEW_MASK                        equ 00C0h

// Register: RC5FEAT
#define RC5FEAT RC5FEAT
RC5FEAT                                  equ 0316h
// bitfield definitions
RC5FEAT_SYSBUF_POSN                      equ 0000h
RC5FEAT_SYSBUF_POSITION                  equ 0000h
RC5FEAT_SYSBUF_SIZE                      equ 0002h
RC5FEAT_SYSBUF_LENGTH                    equ 0002h
RC5FEAT_SYSBUF_MASK                      equ 0003h
RC5FEAT_SLEW_POSN                        equ 0006h
RC5FEAT_SLEW_POSITION                    equ 0006h
RC5FEAT_SLEW_SIZE                        equ 0002h
RC5FEAT_SLEW_LENGTH                      equ 0002h
RC5FEAT_SLEW_MASK                        equ 00C0h

// Register: RA0PPS
#define RA0PPS RA0PPS
RA0PPS                                   equ 0319h
// bitfield definitions
RA0PPS_RA0PPS0_POSN                      equ 0000h
RA0PPS_RA0PPS0_POSITION                  equ 0000h
RA0PPS_RA0PPS0_SIZE                      equ 0001h
RA0PPS_RA0PPS0_LENGTH                    equ 0001h
RA0PPS_RA0PPS0_MASK                      equ 0001h
RA0PPS_RA0PPS1_POSN                      equ 0001h
RA0PPS_RA0PPS1_POSITION                  equ 0001h
RA0PPS_RA0PPS1_SIZE                      equ 0001h
RA0PPS_RA0PPS1_LENGTH                    equ 0001h
RA0PPS_RA0PPS1_MASK                      equ 0002h
RA0PPS_RA0PPS2_POSN                      equ 0002h
RA0PPS_RA0PPS2_POSITION                  equ 0002h
RA0PPS_RA0PPS2_SIZE                      equ 0001h
RA0PPS_RA0PPS2_LENGTH                    equ 0001h
RA0PPS_RA0PPS2_MASK                      equ 0004h
RA0PPS_RA0PPS3_POSN                      equ 0003h
RA0PPS_RA0PPS3_POSITION                  equ 0003h
RA0PPS_RA0PPS3_SIZE                      equ 0001h
RA0PPS_RA0PPS3_LENGTH                    equ 0001h
RA0PPS_RA0PPS3_MASK                      equ 0008h
RA0PPS_RA0PPS4_POSN                      equ 0004h
RA0PPS_RA0PPS4_POSITION                  equ 0004h
RA0PPS_RA0PPS4_SIZE                      equ 0001h
RA0PPS_RA0PPS4_LENGTH                    equ 0001h
RA0PPS_RA0PPS4_MASK                      equ 0010h

// Register: RA1PPS
#define RA1PPS RA1PPS
RA1PPS                                   equ 031Ah
// bitfield definitions
RA1PPS_RA1PPS0_POSN                      equ 0000h
RA1PPS_RA1PPS0_POSITION                  equ 0000h
RA1PPS_RA1PPS0_SIZE                      equ 0001h
RA1PPS_RA1PPS0_LENGTH                    equ 0001h
RA1PPS_RA1PPS0_MASK                      equ 0001h
RA1PPS_RA1PPS1_POSN                      equ 0001h
RA1PPS_RA1PPS1_POSITION                  equ 0001h
RA1PPS_RA1PPS1_SIZE                      equ 0001h
RA1PPS_RA1PPS1_LENGTH                    equ 0001h
RA1PPS_RA1PPS1_MASK                      equ 0002h
RA1PPS_RA1PPS2_POSN                      equ 0002h
RA1PPS_RA1PPS2_POSITION                  equ 0002h
RA1PPS_RA1PPS2_SIZE                      equ 0001h
RA1PPS_RA1PPS2_LENGTH                    equ 0001h
RA1PPS_RA1PPS2_MASK                      equ 0004h
RA1PPS_RA1PPS3_POSN                      equ 0003h
RA1PPS_RA1PPS3_POSITION                  equ 0003h
RA1PPS_RA1PPS3_SIZE                      equ 0001h
RA1PPS_RA1PPS3_LENGTH                    equ 0001h
RA1PPS_RA1PPS3_MASK                      equ 0008h
RA1PPS_RA1PPS4_POSN                      equ 0004h
RA1PPS_RA1PPS4_POSITION                  equ 0004h
RA1PPS_RA1PPS4_SIZE                      equ 0001h
RA1PPS_RA1PPS4_LENGTH                    equ 0001h
RA1PPS_RA1PPS4_MASK                      equ 0010h

// Register: RA2PPS
#define RA2PPS RA2PPS
RA2PPS                                   equ 031Bh
// bitfield definitions
RA2PPS_RA2PPS0_POSN                      equ 0000h
RA2PPS_RA2PPS0_POSITION                  equ 0000h
RA2PPS_RA2PPS0_SIZE                      equ 0001h
RA2PPS_RA2PPS0_LENGTH                    equ 0001h
RA2PPS_RA2PPS0_MASK                      equ 0001h
RA2PPS_RA2PPS1_POSN                      equ 0001h
RA2PPS_RA2PPS1_POSITION                  equ 0001h
RA2PPS_RA2PPS1_SIZE                      equ 0001h
RA2PPS_RA2PPS1_LENGTH                    equ 0001h
RA2PPS_RA2PPS1_MASK                      equ 0002h
RA2PPS_RA2PPS2_POSN                      equ 0002h
RA2PPS_RA2PPS2_POSITION                  equ 0002h
RA2PPS_RA2PPS2_SIZE                      equ 0001h
RA2PPS_RA2PPS2_LENGTH                    equ 0001h
RA2PPS_RA2PPS2_MASK                      equ 0004h
RA2PPS_RA2PPS3_POSN                      equ 0003h
RA2PPS_RA2PPS3_POSITION                  equ 0003h
RA2PPS_RA2PPS3_SIZE                      equ 0001h
RA2PPS_RA2PPS3_LENGTH                    equ 0001h
RA2PPS_RA2PPS3_MASK                      equ 0008h
RA2PPS_RA2PPS4_POSN                      equ 0004h
RA2PPS_RA2PPS4_POSITION                  equ 0004h
RA2PPS_RA2PPS4_SIZE                      equ 0001h
RA2PPS_RA2PPS4_LENGTH                    equ 0001h
RA2PPS_RA2PPS4_MASK                      equ 0010h

// Register: RA4PPS
#define RA4PPS RA4PPS
RA4PPS                                   equ 031Dh
// bitfield definitions
RA4PPS_RA4PPS0_POSN                      equ 0000h
RA4PPS_RA4PPS0_POSITION                  equ 0000h
RA4PPS_RA4PPS0_SIZE                      equ 0001h
RA4PPS_RA4PPS0_LENGTH                    equ 0001h
RA4PPS_RA4PPS0_MASK                      equ 0001h
RA4PPS_RA4PPS1_POSN                      equ 0001h
RA4PPS_RA4PPS1_POSITION                  equ 0001h
RA4PPS_RA4PPS1_SIZE                      equ 0001h
RA4PPS_RA4PPS1_LENGTH                    equ 0001h
RA4PPS_RA4PPS1_MASK                      equ 0002h
RA4PPS_RA4PPS2_POSN                      equ 0002h
RA4PPS_RA4PPS2_POSITION                  equ 0002h
RA4PPS_RA4PPS2_SIZE                      equ 0001h
RA4PPS_RA4PPS2_LENGTH                    equ 0001h
RA4PPS_RA4PPS2_MASK                      equ 0004h
RA4PPS_RA4PPS3_POSN                      equ 0003h
RA4PPS_RA4PPS3_POSITION                  equ 0003h
RA4PPS_RA4PPS3_SIZE                      equ 0001h
RA4PPS_RA4PPS3_LENGTH                    equ 0001h
RA4PPS_RA4PPS3_MASK                      equ 0008h
RA4PPS_RA4PPS4_POSN                      equ 0004h
RA4PPS_RA4PPS4_POSITION                  equ 0004h
RA4PPS_RA4PPS4_SIZE                      equ 0001h
RA4PPS_RA4PPS4_LENGTH                    equ 0001h
RA4PPS_RA4PPS4_MASK                      equ 0010h

