garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f15q20.inc
// Register: INT0PPS
#define INT0PPS INT0PPS
INT0PPS                                  equ 0352h
// bitfield definitions
INT0PPS_INT0PPS_POSN                     equ 0000h
INT0PPS_INT0PPS_POSITION                 equ 0000h
INT0PPS_INT0PPS_SIZE                     equ 0005h
INT0PPS_INT0PPS_LENGTH                   equ 0005h
INT0PPS_INT0PPS_MASK                     equ 001Fh
INT0PPS_INT0PPS0_POSN                    equ 0000h
INT0PPS_INT0PPS0_POSITION                equ 0000h
INT0PPS_INT0PPS0_SIZE                    equ 0001h
INT0PPS_INT0PPS0_LENGTH                  equ 0001h
INT0PPS_INT0PPS0_MASK                    equ 0001h
INT0PPS_INT0PPS1_POSN                    equ 0001h
INT0PPS_INT0PPS1_POSITION                equ 0001h
INT0PPS_INT0PPS1_SIZE                    equ 0001h
INT0PPS_INT0PPS1_LENGTH                  equ 0001h
INT0PPS_INT0PPS1_MASK                    equ 0002h
INT0PPS_INT0PPS2_POSN                    equ 0002h
INT0PPS_INT0PPS2_POSITION                equ 0002h
INT0PPS_INT0PPS2_SIZE                    equ 0001h
INT0PPS_INT0PPS2_LENGTH                  equ 0001h
INT0PPS_INT0PPS2_MASK                    equ 0004h
INT0PPS_INT0PPS3_POSN                    equ 0003h
INT0PPS_INT0PPS3_POSITION                equ 0003h
INT0PPS_INT0PPS3_SIZE                    equ 0001h
INT0PPS_INT0PPS3_LENGTH                  equ 0001h
INT0PPS_INT0PPS3_MASK                    equ 0008h
INT0PPS_INT0PPS4_POSN                    equ 0004h
INT0PPS_INT0PPS4_POSITION                equ 0004h
INT0PPS_INT0PPS4_SIZE                    equ 0001h
INT0PPS_INT0PPS4_LENGTH                  equ 0001h
INT0PPS_INT0PPS4_MASK                    equ 0010h

// Register: INT1PPS
#define INT1PPS INT1PPS
INT1PPS                                  equ 0353h
// bitfield definitions
INT1PPS_INT1PPS_POSN                     equ 0000h
INT1PPS_INT1PPS_POSITION                 equ 0000h
INT1PPS_INT1PPS_SIZE                     equ 0005h
INT1PPS_INT1PPS_LENGTH                   equ 0005h
INT1PPS_INT1PPS_MASK                     equ 001Fh
INT1PPS_INT1PPS0_POSN                    equ 0000h
INT1PPS_INT1PPS0_POSITION                equ 0000h
INT1PPS_INT1PPS0_SIZE                    equ 0001h
INT1PPS_INT1PPS0_LENGTH                  equ 0001h
INT1PPS_INT1PPS0_MASK                    equ 0001h
INT1PPS_INT1PPS1_POSN                    equ 0001h
INT1PPS_INT1PPS1_POSITION                equ 0001h
INT1PPS_INT1PPS1_SIZE                    equ 0001h
INT1PPS_INT1PPS1_LENGTH                  equ 0001h
INT1PPS_INT1PPS1_MASK                    equ 0002h
INT1PPS_INT1PPS2_POSN                    equ 0002h
INT1PPS_INT1PPS2_POSITION                equ 0002h
INT1PPS_INT1PPS2_SIZE                    equ 0001h
INT1PPS_INT1PPS2_LENGTH                  equ 0001h
INT1PPS_INT1PPS2_MASK                    equ 0004h
INT1PPS_INT1PPS3_POSN                    equ 0003h
INT1PPS_INT1PPS3_POSITION                equ 0003h
INT1PPS_INT1PPS3_SIZE                    equ 0001h
INT1PPS_INT1PPS3_LENGTH                  equ 0001h
INT1PPS_INT1PPS3_MASK                    equ 0008h
INT1PPS_INT1PPS4_POSN                    equ 0004h
INT1PPS_INT1PPS4_POSITION                equ 0004h
INT1PPS_INT1PPS4_SIZE                    equ 0001h
INT1PPS_INT1PPS4_LENGTH                  equ 0001h
INT1PPS_INT1PPS4_MASK                    equ 0010h

// Register: INT2PPS
#define INT2PPS INT2PPS
INT2PPS                                  equ 0354h
// bitfield definitions
INT2PPS_INT2PPS_POSN                     equ 0000h
INT2PPS_INT2PPS_POSITION                 equ 0000h
INT2PPS_INT2PPS_SIZE                     equ 0005h
INT2PPS_INT2PPS_LENGTH                   equ 0005h
INT2PPS_INT2PPS_MASK                     equ 001Fh
INT2PPS_INT2PPS0_POSN                    equ 0000h
INT2PPS_INT2PPS0_POSITION                equ 0000h
INT2PPS_INT2PPS0_SIZE                    equ 0001h
INT2PPS_INT2PPS0_LENGTH                  equ 0001h
INT2PPS_INT2PPS0_MASK                    equ 0001h
INT2PPS_INT2PPS1_POSN                    equ 0001h
INT2PPS_INT2PPS1_POSITION                equ 0001h
INT2PPS_INT2PPS1_SIZE                    equ 0001h
INT2PPS_INT2PPS1_LENGTH                  equ 0001h
INT2PPS_INT2PPS1_MASK                    equ 0002h
INT2PPS_INT2PPS2_POSN                    equ 0002h
INT2PPS_INT2PPS2_POSITION                equ 0002h
INT2PPS_INT2PPS2_SIZE                    equ 0001h
INT2PPS_INT2PPS2_LENGTH                  equ 0001h
INT2PPS_INT2PPS2_MASK                    equ 0004h
INT2PPS_INT2PPS3_POSN                    equ 0003h
INT2PPS_INT2PPS3_POSITION                equ 0003h
INT2PPS_INT2PPS3_SIZE                    equ 0001h
INT2PPS_INT2PPS3_LENGTH                  equ 0001h
INT2PPS_INT2PPS3_MASK                    equ 0008h
INT2PPS_INT2PPS4_POSN                    equ 0004h
INT2PPS_INT2PPS4_POSITION                equ 0004h
INT2PPS_INT2PPS4_SIZE                    equ 0001h
INT2PPS_INT2PPS4_LENGTH                  equ 0001h
INT2PPS_INT2PPS4_MASK                    equ 0010h

// Register: T0CKIPPS
#define T0CKIPPS T0CKIPPS
T0CKIPPS                                 equ 0355h
// bitfield definitions
T0CKIPPS_T0CKIPPS_POSN                   equ 0000h
T0CKIPPS_T0CKIPPS_POSITION               equ 0000h
T0CKIPPS_T0CKIPPS_SIZE                   equ 0005h
T0CKIPPS_T0CKIPPS_LENGTH                 equ 0005h
T0CKIPPS_T0CKIPPS_MASK                   equ 001Fh
T0CKIPPS_T0CKIPPS0_POSN                  equ 0000h
T0CKIPPS_T0CKIPPS0_POSITION              equ 0000h
T0CKIPPS_T0CKIPPS0_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS0_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS0_MASK                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSN                  equ 0001h
T0CKIPPS_T0CKIPPS1_POSITION              equ 0001h
T0CKIPPS_T0CKIPPS1_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS1_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS1_MASK                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSN                  equ 0002h
T0CKIPPS_T0CKIPPS2_POSITION              equ 0002h
T0CKIPPS_T0CKIPPS2_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS2_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS2_MASK                  equ 0004h
T0CKIPPS_T0CKIPPS3_POSN                  equ 0003h
T0CKIPPS_T0CKIPPS3_POSITION              equ 0003h
T0CKIPPS_T0CKIPPS3_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS3_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS3_MASK                  equ 0008h
T0CKIPPS_T0CKIPPS4_POSN                  equ 0004h
T0CKIPPS_T0CKIPPS4_POSITION              equ 0004h
T0CKIPPS_T0CKIPPS4_SIZE                  equ 0001h
T0CKIPPS_T0CKIPPS4_LENGTH                equ 0001h
T0CKIPPS_T0CKIPPS4_MASK                  equ 0010h

// Register: T1CKIPPS
#define T1CKIPPS T1CKIPPS
T1CKIPPS                                 equ 0356h
// bitfield definitions
T1CKIPPS_T1CKIPPS_POSN                   equ 0000h
T1CKIPPS_T1CKIPPS_POSITION               equ 0000h
T1CKIPPS_T1CKIPPS_SIZE                   equ 0005h
T1CKIPPS_T1CKIPPS_LENGTH                 equ 0005h
T1CKIPPS_T1CKIPPS_MASK                   equ 001Fh
T1CKIPPS_T1CKIPPS0_POSN                  equ 0000h
T1CKIPPS_T1CKIPPS0_POSITION              equ 0000h
T1CKIPPS_T1CKIPPS0_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS0_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS0_MASK                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSN                  equ 0001h
T1CKIPPS_T1CKIPPS1_POSITION              equ 0001h
T1CKIPPS_T1CKIPPS1_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS1_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS1_MASK                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSN                  equ 0002h
T1CKIPPS_T1CKIPPS2_POSITION              equ 0002h
T1CKIPPS_T1CKIPPS2_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS2_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS2_MASK                  equ 0004h
T1CKIPPS_T1CKIPPS3_POSN                  equ 0003h
T1CKIPPS_T1CKIPPS3_POSITION              equ 0003h
T1CKIPPS_T1CKIPPS3_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS3_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS3_MASK                  equ 0008h
T1CKIPPS_T1CKIPPS4_POSN                  equ 0004h
T1CKIPPS_T1CKIPPS4_POSITION              equ 0004h
T1CKIPPS_T1CKIPPS4_SIZE                  equ 0001h
T1CKIPPS_T1CKIPPS4_LENGTH                equ 0001h
T1CKIPPS_T1CKIPPS4_MASK                  equ 0010h

// Register: T1GPPS
#define T1GPPS T1GPPS
T1GPPS                                   equ 0357h
// bitfield definitions
T1GPPS_T1GPPS_POSN                       equ 0000h
T1GPPS_T1GPPS_POSITION                   equ 0000h
T1GPPS_T1GPPS_SIZE                       equ 0005h
T1GPPS_T1GPPS_LENGTH                     equ 0005h
T1GPPS_T1GPPS_MASK                       equ 001Fh
T1GPPS_T1GPPS0_POSN                      equ 0000h
T1GPPS_T1GPPS0_POSITION                  equ 0000h
T1GPPS_T1GPPS0_SIZE                      equ 0001h
T1GPPS_T1GPPS0_LENGTH                    equ 0001h
T1GPPS_T1GPPS0_MASK                      equ 0001h
T1GPPS_T1GPPS1_POSN                      equ 0001h
T1GPPS_T1GPPS1_POSITION                  equ 0001h
T1GPPS_T1GPPS1_SIZE                      equ 0001h
T1GPPS_T1GPPS1_LENGTH                    equ 0001h
T1GPPS_T1GPPS1_MASK                      equ 0002h
T1GPPS_T1GPPS2_POSN                      equ 0002h
T1GPPS_T1GPPS2_POSITION                  equ 0002h
T1GPPS_T1GPPS2_SIZE                      equ 0001h
T1GPPS_T1GPPS2_LENGTH                    equ 0001h
T1GPPS_T1GPPS2_MASK                      equ 0004h
T1GPPS_T1GPPS3_POSN                      equ 0003h
T1GPPS_T1GPPS3_POSITION                  equ 0003h
T1GPPS_T1GPPS3_SIZE                      equ 0001h
T1GPPS_T1GPPS3_LENGTH                    equ 0001h
T1GPPS_T1GPPS3_MASK                      equ 0008h
T1GPPS_T1GPPS4_POSN                      equ 0004h
T1GPPS_T1GPPS4_POSITION                  equ 0004h
T1GPPS_T1GPPS4_SIZE                      equ 0001h
T1GPPS_T1GPPS4_LENGTH                    equ 0001h
T1GPPS_T1GPPS4_MASK                      equ 0010h

