garyPenhook/PIC-Assembler/Microchip.PIC18F-Q_DFP.1.28.451.atpack_FILES/xc8/pic/include/proc/pic18f15q20.inc
// Register: PIR5
#define PIR5 PIR5
PIR5                                     equ 046Eh
// bitfield definitions
PIR5_PWM2PIF_POSN                        equ 0000h
PIR5_PWM2PIF_POSITION                    equ 0000h
PIR5_PWM2PIF_SIZE                        equ 0001h
PIR5_PWM2PIF_LENGTH                      equ 0001h
PIR5_PWM2PIF_MASK                        equ 0001h
PIR5_PWM2IF_POSN                         equ 0001h
PIR5_PWM2IF_POSITION                     equ 0001h
PIR5_PWM2IF_SIZE                         equ 0001h
PIR5_PWM2IF_LENGTH                       equ 0001h
PIR5_PWM2IF_MASK                         equ 0002h
PIR5_CWG1IF_POSN                         equ 0002h
PIR5_CWG1IF_POSITION                     equ 0002h
PIR5_CWG1IF_SIZE                         equ 0001h
PIR5_CWG1IF_LENGTH                       equ 0001h
PIR5_CWG1IF_MASK                         equ 0004h
PIR5_CLC1IF_POSN                         equ 0003h
PIR5_CLC1IF_POSITION                     equ 0003h
PIR5_CLC1IF_SIZE                         equ 0001h
PIR5_CLC1IF_LENGTH                       equ 0001h
PIR5_CLC1IF_MASK                         equ 0008h
PIR5_CLC2IF_POSN                         equ 0004h
PIR5_CLC2IF_POSITION                     equ 0004h
PIR5_CLC2IF_SIZE                         equ 0001h
PIR5_CLC2IF_LENGTH                       equ 0001h
PIR5_CLC2IF_MASK                         equ 0010h
PIR5_CLC3IF_POSN                         equ 0005h
PIR5_CLC3IF_POSITION                     equ 0005h
PIR5_CLC3IF_SIZE                         equ 0001h
PIR5_CLC3IF_LENGTH                       equ 0001h
PIR5_CLC3IF_MASK                         equ 0020h
PIR5_CLC4IF_POSN                         equ 0006h
PIR5_CLC4IF_POSITION                     equ 0006h
PIR5_CLC4IF_SIZE                         equ 0001h
PIR5_CLC4IF_LENGTH                       equ 0001h
PIR5_CLC4IF_MASK                         equ 0040h
PIR5_IOCSRIF_POSN                        equ 0007h
PIR5_IOCSRIF_POSITION                    equ 0007h
PIR5_IOCSRIF_SIZE                        equ 0001h
PIR5_IOCSRIF_LENGTH                      equ 0001h
PIR5_IOCSRIF_MASK                        equ 0080h

// Register: PIR6
#define PIR6 PIR6
PIR6                                     equ 046Fh
// bitfield definitions
PIR6_U1RXIF_POSN                         equ 0000h
PIR6_U1RXIF_POSITION                     equ 0000h
PIR6_U1RXIF_SIZE                         equ 0001h
PIR6_U1RXIF_LENGTH                       equ 0001h
PIR6_U1RXIF_MASK                         equ 0001h
PIR6_U1TXIF_POSN                         equ 0001h
PIR6_U1TXIF_POSITION                     equ 0001h
PIR6_U1TXIF_SIZE                         equ 0001h
PIR6_U1TXIF_LENGTH                       equ 0001h
PIR6_U1TXIF_MASK                         equ 0002h
PIR6_U1IF_POSN                           equ 0002h
PIR6_U1IF_POSITION                       equ 0002h
PIR6_U1IF_SIZE                           equ 0001h
PIR6_U1IF_LENGTH                         equ 0001h
PIR6_U1IF_MASK                           equ 0004h
PIR6_U1EIF_POSN                          equ 0003h
PIR6_U1EIF_POSITION                      equ 0003h
PIR6_U1EIF_SIZE                          equ 0001h
PIR6_U1EIF_LENGTH                        equ 0001h
PIR6_U1EIF_MASK                          equ 0008h
PIR6_U2RXIF_POSN                         equ 0004h
PIR6_U2RXIF_POSITION                     equ 0004h
PIR6_U2RXIF_SIZE                         equ 0001h
PIR6_U2RXIF_LENGTH                       equ 0001h
PIR6_U2RXIF_MASK                         equ 0010h
PIR6_U2TXIF_POSN                         equ 0005h
PIR6_U2TXIF_POSITION                     equ 0005h
PIR6_U2TXIF_SIZE                         equ 0001h
PIR6_U2TXIF_LENGTH                       equ 0001h
PIR6_U2TXIF_MASK                         equ 0020h
PIR6_U2IF_POSN                           equ 0006h
PIR6_U2IF_POSITION                       equ 0006h
PIR6_U2IF_SIZE                           equ 0001h
PIR6_U2IF_LENGTH                         equ 0001h
PIR6_U2IF_MASK                           equ 0040h
PIR6_U2EIF_POSN                          equ 0007h
PIR6_U2EIF_POSITION                      equ 0007h
PIR6_U2EIF_SIZE                          equ 0001h
PIR6_U2EIF_LENGTH                        equ 0001h
PIR6_U2EIF_MASK                          equ 0080h

// Register: PIR7
#define PIR7 PIR7
PIR7                                     equ 0470h
// bitfield definitions
PIR7_SPI1RXIF_POSN                       equ 0000h
PIR7_SPI1RXIF_POSITION                   equ 0000h
PIR7_SPI1RXIF_SIZE                       equ 0001h
PIR7_SPI1RXIF_LENGTH                     equ 0001h
PIR7_SPI1RXIF_MASK                       equ 0001h
PIR7_SPI1TXIF_POSN                       equ 0001h
PIR7_SPI1TXIF_POSITION                   equ 0001h
PIR7_SPI1TXIF_SIZE                       equ 0001h
PIR7_SPI1TXIF_LENGTH                     equ 0001h
PIR7_SPI1TXIF_MASK                       equ 0002h
PIR7_SPI1IF_POSN                         equ 0002h
PIR7_SPI1IF_POSITION                     equ 0002h
PIR7_SPI1IF_SIZE                         equ 0001h
PIR7_SPI1IF_LENGTH                       equ 0001h
PIR7_SPI1IF_MASK                         equ 0004h
PIR7_I2C1RXIF_POSN                       equ 0003h
PIR7_I2C1RXIF_POSITION                   equ 0003h
PIR7_I2C1RXIF_SIZE                       equ 0001h
PIR7_I2C1RXIF_LENGTH                     equ 0001h
PIR7_I2C1RXIF_MASK                       equ 0008h
PIR7_I2C1TXIF_POSN                       equ 0004h
PIR7_I2C1TXIF_POSITION                   equ 0004h
PIR7_I2C1TXIF_SIZE                       equ 0001h
PIR7_I2C1TXIF_LENGTH                     equ 0001h
PIR7_I2C1TXIF_MASK                       equ 0010h
PIR7_I2C1IF_POSN                         equ 0005h
PIR7_I2C1IF_POSITION                     equ 0005h
PIR7_I2C1IF_SIZE                         equ 0001h
PIR7_I2C1IF_LENGTH                       equ 0001h
PIR7_I2C1IF_MASK                         equ 0020h
PIR7_I2C1EIF_POSN                        equ 0006h
PIR7_I2C1EIF_POSITION                    equ 0006h
PIR7_I2C1EIF_SIZE                        equ 0001h
PIR7_I2C1EIF_LENGTH                      equ 0001h
PIR7_I2C1EIF_MASK                        equ 0040h

// Register: PIR8
#define PIR8 PIR8
PIR8                                     equ 0471h
// bitfield definitions
PIR8_I3C1RXIF_POSN                       equ 0000h
PIR8_I3C1RXIF_POSITION                   equ 0000h
PIR8_I3C1RXIF_SIZE                       equ 0001h
PIR8_I3C1RXIF_LENGTH                     equ 0001h
PIR8_I3C1RXIF_MASK                       equ 0001h
PIR8_I3C1TXIF_POSN                       equ 0001h
PIR8_I3C1TXIF_POSITION                   equ 0001h
PIR8_I3C1TXIF_SIZE                       equ 0001h
PIR8_I3C1TXIF_LENGTH                     equ 0001h
PIR8_I3C1TXIF_MASK                       equ 0002h
PIR8_I3C1IF_POSN                         equ 0002h
PIR8_I3C1IF_POSITION                     equ 0002h
PIR8_I3C1IF_SIZE                         equ 0001h
PIR8_I3C1IF_LENGTH                       equ 0001h
PIR8_I3C1IF_MASK                         equ 0004h
PIR8_I3C1EIF_POSN                        equ 0003h
PIR8_I3C1EIF_POSITION                    equ 0003h
PIR8_I3C1EIF_SIZE                        equ 0001h
PIR8_I3C1EIF_LENGTH                      equ 0001h
PIR8_I3C1EIF_MASK                        equ 0008h
PIR8_I3C1RIF_POSN                        equ 0004h
PIR8_I3C1RIF_POSITION                    equ 0004h
PIR8_I3C1RIF_SIZE                        equ 0001h
PIR8_I3C1RIF_LENGTH                      equ 0001h
PIR8_I3C1RIF_MASK                        equ 0010h

// Register: PIR9
#define PIR9 PIR9
PIR9                                     equ 0472h
// bitfield definitions
PIR9_I3C2RXIF_POSN                       equ 0000h
PIR9_I3C2RXIF_POSITION                   equ 0000h
PIR9_I3C2RXIF_SIZE                       equ 0001h
PIR9_I3C2RXIF_LENGTH                     equ 0001h
PIR9_I3C2RXIF_MASK                       equ 0001h
PIR9_I3C2TXIF_POSN                       equ 0001h
PIR9_I3C2TXIF_POSITION                   equ 0001h
PIR9_I3C2TXIF_SIZE                       equ 0001h
PIR9_I3C2TXIF_LENGTH                     equ 0001h
PIR9_I3C2TXIF_MASK                       equ 0002h
PIR9_I3C2IF_POSN                         equ 0002h
PIR9_I3C2IF_POSITION                     equ 0002h
PIR9_I3C2IF_SIZE                         equ 0001h
PIR9_I3C2IF_LENGTH                       equ 0001h
PIR9_I3C2IF_MASK                         equ 0004h
PIR9_I3C2EIF_POSN                        equ 0003h
PIR9_I3C2EIF_POSITION                    equ 0003h
PIR9_I3C2EIF_SIZE                        equ 0001h
PIR9_I3C2EIF_LENGTH                      equ 0001h
PIR9_I3C2EIF_MASK                        equ 0008h
PIR9_I3C2RIF_POSN                        equ 0004h
PIR9_I3C2RIF_POSITION                    equ 0004h
PIR9_I3C2RIF_SIZE                        equ 0001h
PIR9_I3C2RIF_LENGTH                      equ 0001h
PIR9_I3C2RIF_MASK                        equ 0010h
PIR9_HLVDIF_POSN                         equ 0005h
PIR9_HLVDIF_POSITION                     equ 0005h
PIR9_HLVDIF_SIZE                         equ 0001h
PIR9_HLVDIF_LENGTH                       equ 0001h
PIR9_HLVDIF_MASK                         equ 0020h
PIR9_ADIF_POSN                           equ 0006h
PIR9_ADIF_POSITION                       equ 0006h
PIR9_ADIF_SIZE                           equ 0001h
PIR9_ADIF_LENGTH                         equ 0001h
PIR9_ADIF_MASK                           equ 0040h
PIR9_ADTIF_POSN                          equ 0007h
PIR9_ADTIF_POSITION                      equ 0007h
PIR9_ADTIF_SIZE                          equ 0001h
PIR9_ADTIF_LENGTH                        equ 0001h
PIR9_ADTIF_MASK                          equ 0080h

// Register: PIE0
#define PIE0 PIE0
PIE0                                     equ 0473h
// bitfield definitions
PIE0_SWIE_POSN                           equ 0000h
PIE0_SWIE_POSITION                       equ 0000h
PIE0_SWIE_SIZE                           equ 0001h
PIE0_SWIE_LENGTH                         equ 0001h
PIE0_SWIE_MASK                           equ 0001h
PIE0_INT0IE_POSN                         equ 0001h
PIE0_INT0IE_POSITION                     equ 0001h
PIE0_INT0IE_SIZE                         equ 0001h
PIE0_INT0IE_LENGTH                       equ 0001h
PIE0_INT0IE_MASK                         equ 0002h
PIE0_INT1IE_POSN                         equ 0002h
PIE0_INT1IE_POSITION                     equ 0002h
PIE0_INT1IE_SIZE                         equ 0001h
PIE0_INT1IE_LENGTH                       equ 0001h
PIE0_INT1IE_MASK                         equ 0004h
PIE0_INT2IE_POSN                         equ 0003h
PIE0_INT2IE_POSITION                     equ 0003h
PIE0_INT2IE_SIZE                         equ 0001h
PIE0_INT2IE_LENGTH                       equ 0001h
PIE0_INT2IE_MASK                         equ 0008h
PIE0_DMA1SCNTIE_POSN                     equ 0004h
PIE0_DMA1SCNTIE_POSITION                 equ 0004h
PIE0_DMA1SCNTIE_SIZE                     equ 0001h
PIE0_DMA1SCNTIE_LENGTH                   equ 0001h
PIE0_DMA1SCNTIE_MASK                     equ 0010h
PIE0_DMA1DCNTIE_POSN                     equ 0005h
PIE0_DMA1DCNTIE_POSITION                 equ 0005h
PIE0_DMA1DCNTIE_SIZE                     equ 0001h
PIE0_DMA1DCNTIE_LENGTH                   equ 0001h
PIE0_DMA1DCNTIE_MASK                     equ 0020h
PIE0_DMA1ORIE_POSN                       equ 0006h
PIE0_DMA1ORIE_POSITION                   equ 0006h
PIE0_DMA1ORIE_SIZE                       equ 0001h
PIE0_DMA1ORIE_LENGTH                     equ 0001h
PIE0_DMA1ORIE_MASK                       equ 0040h
PIE0_DMA1AIE_POSN                        equ 0007h
PIE0_DMA1AIE_POSITION                    equ 0007h
PIE0_DMA1AIE_SIZE                        equ 0001h
PIE0_DMA1AIE_LENGTH                      equ 0001h
PIE0_DMA1AIE_MASK                        equ 0080h

// Register: PIE1
#define PIE1 PIE1
PIE1                                     equ 0474h
// bitfield definitions
PIE1_DMA2SCNTIE_POSN                     equ 0000h
PIE1_DMA2SCNTIE_POSITION                 equ 0000h
PIE1_DMA2SCNTIE_SIZE                     equ 0001h
PIE1_DMA2SCNTIE_LENGTH                   equ 0001h
PIE1_DMA2SCNTIE_MASK                     equ 0001h
PIE1_DMA2DCNTIE_POSN                     equ 0001h
PIE1_DMA2DCNTIE_POSITION                 equ 0001h
PIE1_DMA2DCNTIE_SIZE                     equ 0001h
PIE1_DMA2DCNTIE_LENGTH                   equ 0001h
PIE1_DMA2DCNTIE_MASK                     equ 0002h
PIE1_DMA2ORIE_POSN                       equ 0002h
PIE1_DMA2ORIE_POSITION                   equ 0002h
PIE1_DMA2ORIE_SIZE                       equ 0001h
PIE1_DMA2ORIE_LENGTH                     equ 0001h
PIE1_DMA2ORIE_MASK                       equ 0004h
PIE1_DMA2AIE_POSN                        equ 0003h
PIE1_DMA2AIE_POSITION                    equ 0003h
PIE1_DMA2AIE_SIZE                        equ 0001h
PIE1_DMA2AIE_LENGTH                      equ 0001h
PIE1_DMA2AIE_MASK                        equ 0008h
PIE1_DMA3SCNTIE_POSN                     equ 0004h
PIE1_DMA3SCNTIE_POSITION                 equ 0004h
PIE1_DMA3SCNTIE_SIZE                     equ 0001h
PIE1_DMA3SCNTIE_LENGTH                   equ 0001h
PIE1_DMA3SCNTIE_MASK                     equ 0010h
PIE1_DMA3DCNTIE_POSN                     equ 0005h
PIE1_DMA3DCNTIE_POSITION                 equ 0005h
PIE1_DMA3DCNTIE_SIZE                     equ 0001h
PIE1_DMA3DCNTIE_LENGTH                   equ 0001h
PIE1_DMA3DCNTIE_MASK                     equ 0020h
PIE1_DMA3ORIE_POSN                       equ 0006h
PIE1_DMA3ORIE_POSITION                   equ 0006h
PIE1_DMA3ORIE_SIZE                       equ 0001h
PIE1_DMA3ORIE_LENGTH                     equ 0001h
PIE1_DMA3ORIE_MASK                       equ 0040h
PIE1_DMA3AIE_POSN                        equ 0007h
PIE1_DMA3AIE_POSITION                    equ 0007h
PIE1_DMA3AIE_SIZE                        equ 0001h
PIE1_DMA3AIE_LENGTH                      equ 0001h
PIE1_DMA3AIE_MASK                        equ 0080h

// Register: PIE2
#define PIE2 PIE2
PIE2                                     equ 0475h
// bitfield definitions
PIE2_DMA4SCNTIE_POSN                     equ 0000h
PIE2_DMA4SCNTIE_POSITION                 equ 0000h
PIE2_DMA4SCNTIE_SIZE                     equ 0001h
PIE2_DMA4SCNTIE_LENGTH                   equ 0001h
PIE2_DMA4SCNTIE_MASK                     equ 0001h
PIE2_DMA4DCNTIE_POSN                     equ 0001h
PIE2_DMA4DCNTIE_POSITION                 equ 0001h
PIE2_DMA4DCNTIE_SIZE                     equ 0001h
PIE2_DMA4DCNTIE_LENGTH                   equ 0001h
PIE2_DMA4DCNTIE_MASK                     equ 0002h
PIE2_DMA4ORIE_POSN                       equ 0002h
PIE2_DMA4ORIE_POSITION                   equ 0002h
PIE2_DMA4ORIE_SIZE                       equ 0001h
PIE2_DMA4ORIE_LENGTH                     equ 0001h
PIE2_DMA4ORIE_MASK                       equ 0004h
PIE2_DMA4AIE_POSN                        equ 0003h
PIE2_DMA4AIE_POSITION                    equ 0003h
PIE2_DMA4AIE_SIZE                        equ 0001h
PIE2_DMA4AIE_LENGTH                      equ 0001h
PIE2_DMA4AIE_MASK                        equ 0008h
PIE2_NVMIE_POSN                          equ 0004h
PIE2_NVMIE_POSITION                      equ 0004h
PIE2_NVMIE_SIZE                          equ 0001h
PIE2_NVMIE_LENGTH                        equ 0001h
PIE2_NVMIE_MASK                          equ 0010h
PIE2_CRCIE_POSN                          equ 0005h
PIE2_CRCIE_POSITION                      equ 0005h
PIE2_CRCIE_SIZE                          equ 0001h
PIE2_CRCIE_LENGTH                        equ 0001h
PIE2_CRCIE_MASK                          equ 0020h
PIE2_SCANIE_POSN                         equ 0006h
PIE2_SCANIE_POSITION                     equ 0006h
PIE2_SCANIE_SIZE                         equ 0001h
PIE2_SCANIE_LENGTH                       equ 0001h
PIE2_SCANIE_MASK                         equ 0040h
PIE2_ACTIE_POSN                          equ 0007h
PIE2_ACTIE_POSITION                      equ 0007h
PIE2_ACTIE_SIZE                          equ 0001h
PIE2_ACTIE_LENGTH                        equ 0001h
PIE2_ACTIE_MASK                          equ 0080h

// Register: PIE3
#define PIE3 PIE3
PIE3                                     equ 0476h
// bitfield definitions
PIE3_CSWIE_POSN                          equ 0000h
PIE3_CSWIE_POSITION                      equ 0000h
PIE3_CSWIE_SIZE                          equ 0001h
PIE3_CSWIE_LENGTH                        equ 0001h
PIE3_CSWIE_MASK                          equ 0001h
PIE3_OSFIE_POSN                          equ 0001h
PIE3_OSFIE_POSITION                      equ 0001h
PIE3_OSFIE_SIZE                          equ 0001h
PIE3_OSFIE_LENGTH                        equ 0001h
PIE3_OSFIE_MASK                          equ 0002h
PIE3_VDDIO2IE_POSN                       equ 0002h
PIE3_VDDIO2IE_POSITION                   equ 0002h
PIE3_VDDIO2IE_SIZE                       equ 0001h
PIE3_VDDIO2IE_LENGTH                     equ 0001h
PIE3_VDDIO2IE_MASK                       equ 0004h
PIE3_VDDIO3IE_POSN                       equ 0003h
PIE3_VDDIO3IE_POSITION                   equ 0003h
PIE3_VDDIO3IE_SIZE                       equ 0001h
PIE3_VDDIO3IE_LENGTH                     equ 0001h
PIE3_VDDIO3IE_MASK                       equ 0008h
PIE3_IOCIE_POSN                          equ 0004h
PIE3_IOCIE_POSITION                      equ 0004h
PIE3_IOCIE_SIZE                          equ 0001h
PIE3_IOCIE_LENGTH                        equ 0001h
PIE3_IOCIE_MASK                          equ 0010h
PIE3_TMR0IE_POSN                         equ 0005h
PIE3_TMR0IE_POSITION                     equ 0005h
PIE3_TMR0IE_SIZE                         equ 0001h
PIE3_TMR0IE_LENGTH                       equ 0001h
PIE3_TMR0IE_MASK                         equ 0020h
PIE3_TMR1IE_POSN                         equ 0006h
PIE3_TMR1IE_POSITION                     equ 0006h
PIE3_TMR1IE_SIZE                         equ 0001h
PIE3_TMR1IE_LENGTH                       equ 0001h
PIE3_TMR1IE_MASK                         equ 0040h
PIE3_TMR1GIE_POSN                        equ 0007h
PIE3_TMR1GIE_POSITION                    equ 0007h
PIE3_TMR1GIE_SIZE                        equ 0001h
PIE3_TMR1GIE_LENGTH                      equ 0001h
PIE3_TMR1GIE_MASK                        equ 0080h

